#Вывести на экран числа от -N до N

N = int(input ("Введите число "))
range (-N,N+1)
print (list(range (-N,N+1)))